Revit 2027 API
DimensionSegment.ValueOverride Property
The text that replaces the segment's value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ValueOverride { get; set; }
Public Property ValueOverride As String
	Get
	Set
public:
property String^ ValueOverride {
	String^ get ();
	void set (String^ value);
}
member ValueOverride : string with get, set
Property Value
String
See Also
Reference
DimensionSegment Class
Autodesk.Revit.DB Namespace